In [1]:
import pandas as pd
import sqlite3

conn = sqlite3.connect(r"C:\Users\ullas\Downloads\Chipster Assignment\Db-IMDB.db")

In [2]:
# Solution (a) : Film(s) with largest cast.

df = pd.read_sql_query("SELECT Movie.title as Title, COUNT(DISTINCT M_Cast.PID) as Cast_Size FROM Movie, M_Cast WHERE M_Cast.MID = Movie.MID GROUP BY M_Cast.MID ORDER BY Cast_Size DESC LIMIT 1;", conn)
df

           Title  Cast_Size
0  Ocean's Eight        238

In [4]:
# Solution (b) : The number of movies in that particular year that had only female actors. 

dg = pd.read_sql_query("SELECT Movie.year, COUNT(*) AS number_of_movies FROM Movie WHERE Movie.MID IN (SELECT M_Cast.MID FROM M_Cast, Person WHERE M_Cast.PID = Person.PID AND Person.Gender = 'Female');", conn)
dg

   year  number_of_movies
0  None                 0